InformationRegisters/ЗадачиЛояльностиПакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиЛояльностиПакеты</Name>
			<Comment>Связь между мастерпродажей и остальными продажами пакета</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПакета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура пакета задач (пакета продаж)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Сигнатура документа продажи = сигнатура задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗадачиЛояльностиПакеты/Ext/ManagerModule.bsl
Функция Добавить(Сигнатура,	Продажа) Экспорт
		
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка") И ТипЗнч(Продажа) = Тип("Строка") И ЗначениеЗаполнено(Сигнатура) И ЗначениеЗаполнено(Продажа);
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("Добавить", УровеньЖурналаРегистрации.Ошибка, ,"Сигнатура = "+	Сигнатура + "Продажа = " + Продажа, "неверные параметры");
		Возврат  Ложь
	КонецЕсли;
	
	НЗ = РегистрыСведений.ЗадачиЛояльностиПакеты.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура 	= Сигнатура;
	НЗ.Продажа 		= Продажа;
	
	НЗ.Прочитать();
	Если НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	НЗ.Сигнатура 	= Сигнатура;
	НЗ.Продажа		= Продажа;
	НЗ.ДатаПакета	= ТекущаяДата();			

	Попытка
		НЗ.Записать();
	Исключение  
		ЗаписьЖурналаРегистрации("Добавить", УровеньЖурналаРегистрации.Ошибка, ,"Сигнатура = "+	Сигнатура + "Продажа = " + Продажа, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат  Ложь;
	КонецПопытки;
	
	Возврат Истина;
		
КонецФункции
